---
kind: property
id: P:Autodesk.Revit.DB.CurtainGridLine.IsUGridLine
source: html/71ec9099-79fa-07b0-495d-74ad73d6d4d8.htm
---
# Autodesk.Revit.DB.CurtainGridLine.IsUGridLine Property

Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine

## Syntax (C#)
```csharp
public bool IsUGridLine { get; }
```